
*** more org-roam + deft + org-ref +
#+BEGIN_SRC emacs-lisp
(setq
 bibtex-completion-notes-path "/home/alkhaldieid/Dropbox/org/roam/"
 bibtex-completion-bibliography "/Dropbox/mend/library.bib"
 bibtex-completion-pdf-field "file"
 bibtex-completion-notes-template-multiple-files
 (concat
  "#+TITLE: ${title}\n"
  "#+ROAM_KEY: cite:${=key=}\n"
  "* TODO Notes\n"
  ":PROPERTIES:\n"
  ":Custom_ID: ${=key=}\n"
  ":NOTER_DOCUMENT: %(orb-process-file-field \"${=key=}\")\n"
  ":AUTHOR: ${author-abbrev}\n"
  ":JOURNAL: ${journaltitle}\n"
  ":DATE: ${date}\n"
  ":YEAR: ${year}\n"
  ":DOI: ${doi}\n"
  ":URL: ${url}\n"
  ":END:\n\n"
  )
 )
 

(setq
   bibtex-completion-notes-path "/home/alkhaldieid/Dropbox/org/roam/notes"
   bibtex-completion-bibliography "/home/alkhaldieid/Dropbox/mend/library.bib"
   bibtex-completion-pdf-field "file"
   bibtex-completion-notes-template-multiple-files
   (concat
     "#+TITLE: ${title}\n"
     "#+ROAM_KEY: cite:${=key=}\n"
     "* TODO Notes\n"
     ":PROPERTIES:\n"
     ":Custom_ID: ${=key=}\n"
     ":NOTER_DOCUMENT: %(orb-process-file-field \"${=key=}\")\n"
     ":AUTHOR: ${author-abbrev}\n"
     ":JOURNAL: ${journaltitle}\n"
     ":DATE: ${date}\n"
     ":YEAR: ${year}\n"
     ":DOI: ${doi}\n"
     ":URL: ${url}\n"
     ":END:\n\n"
     )
)
(setq
       org-ref-completion-library 'org-ref-ivy-cite
       org-ref-get-pdf-filename-function 'org-ref-get-pdf-filename-helm-bibtex
       org-ref-default-bibliography (list "/home/alkhaldieid/Dropbox/mend/library.bib")
       org-ref-bibliography-notes "/home/alkhaldieid/Dropbox/org/roam/bibnotes.org"
       org-ref-note-title-format "* TODO %y - %t\n :PROPERTIES:\n  :Custom_ID: %k\n  :NOTER_DOCUMENT: %F\n :ROAM_KEY: cite:%k\n  :AUTHOR: %9a\n  :JOURNAL: %j\n  :YEAR: %y\n  :VOLUME: %v\n  :PAGES: %p\n  :DOI: %D\n  :URL: %U\n :END:\n\n"
       org-ref-notes-directory "/home/alkhaldieid/Dropbox/org/roam/"
       org-ref-notes-function 'orb-edit-notes
  )
(setq
 org-noter-default-notes-file-name '("/home/alkhaldieid/Dropbox/notes.org")
 org-noter-default-search-path '("/home/alkhaldieid/Dropbox/mend")

 )


;;;;;;;;;;DEFT config
(setq deft-directory "~/Dropbox/org/roam")

#+END_SRC

#+RESULTS:
: ~/Dropbox/org/roam

